Tekla Open API Reference for Tekla Structures 2025
Line Properties
The Line type exposes the following members.
Properties
Name | Description
Direction
 The direction vector of the line.
Origin
 The origin of the line.
Top
See Also
Reference
Line Class
Tekla.Structures.Geometry3d Namespace